---
title: Vonbrigði
author: Gísli Kristjánsson
tags: icelandic
id: 14
timestamp: 09.12.2008 22:44:06
filename: 2008-12-09-vonbrigði.html
---

<p>&THORN;&oacute; tilgangurinn me&eth; &thorn;essu bloggi s&eacute; a&eth; f&aacute; &uacute;tr&aacute;s fyrir n&ouml;rdaskap, me&eth; &thorn;v&iacute; a&eth; l&aelig;ra <span style="font-style: italic;">Haskell,</span>&nbsp;er hann ekki s&iacute;&eth;ur a&eth; stu&eth;la a&eth; umr&aelig;&eth;u &aacute;hugaf&oacute;lks um <span style="font-style: italic;">Haskell </span>og &thorn;v&iacute; &aacute;kva&eth; &eacute;g a&eth; gera <a href="http://www.google.is/search?source=ig&amp;hl=is&amp;rlz=&amp;q=Haskell&amp;btnG=Google+leit&amp;meta=lr%3Dlang_is">&ouml;rlitla</a> k&ouml;nnun &aacute; m&ouml;gulegum markh&oacute;pi fyrir svona blogg. M&eacute;r til mikilla vonbrig&eth;a vir&eth;ist enginn &aacute; &Iacute;slandi hafa &aacute;huga &aacute; &thorn;essu forritunarm&aacute;li &thorn;v&iacute; &thorn;etta eru ni&eth;urst&ouml;&eth;urnar fyrir utan &thorn;&aelig;r s&iacute;&eth;ur sem &eacute;g &aacute;tti:</p>
<ul>
<li><a href="http://hugi.is/">Hugi</a> er me&eth; f&aacute;t&aelig;klegan <a href="http://www.hugi.is/heimspeki/tenglar.php?path=/Computers/Programming/Languages/Haskell/">tenglalista</a></li>
<li>Baldur Fj&ouml;lnisson <a href="http://gammon.blog.is/blog/gammon/entry/523499/">minnist</a> &aacute; Haskell&nbsp;</li>
<li>Ragnar Frosti <a href="http://www.ragnarfrosti.com/blog/old_blog/2007/11/">b&ouml;lvar</a> &thorn;v&iacute;</li>
<li>Einar &THORN;&oacute;r giskar &aacute; Haskell &iacute; <a href="http://einar.wordpress.com/2006/05/14/&thorn;ekki&eth;i-mali&eth;/">spurningakeppni</a> Einars J&oacute;nssonar</li>
<li>Og, Sigurlaug <a href="http://sigurlaugh.blogspot.com/2004_10_01_archive.html">segist</a> hafa veri&eth; a&eth; lesa um Haskell</li>
</ul>
<blockquote>
<p>Fyrir utan Arnar &thorn;&aacute; held &eacute;g a&eth;&nbsp;<span style="font-style: italic;">Haskell-</span>samf&eacute;lagi&eth; &aacute; &Iacute;slandi s&eacute; ekki til og &eacute;g hef &thorn;v&iacute; og mun &thorn;v&iacute; tala fyrir daufum eyrum h&eacute;rna &aacute; &thorn;essu bloggi.&nbsp;</p>
</blockquote>
<p>&Aacute; s&iacute;&eth;ustu vikum hef &eacute;g &thorn;&oacute; teki&eth; eftir <a href="http://www.hvergi.net/author/arnar/">Arnari</a> nokkrum Birgissyni (syni <a href="http://biggibraga.blog.is/blog/biggibraga/">Birgis &THORN;&oacute;rs Bragasonar</a>) sem &eacute;g man eftir &uacute;r Verzl&oacute;. Hann hefur veri&eth; a&eth; skrifa um <span style="font-style: italic;">Haskell</span>&nbsp;erlendis, b&aelig;&eth;i &aacute; p&oacute;stlista og einnig ranns&oacute;knargreinar. &THORN;a&eth; er svona spurning hvort ma&eth;ur eigi a&eth; setja sig &iacute; samband vi&eth; hann.&nbsp;</p>
<p>Fyrir utan Arnar &thorn;&aacute; held &eacute;g a&eth; <span style="font-style: italic;">Haskell-</span>samf&eacute;lagi&eth; &aacute; &Iacute;slandi s&eacute; ekki til og &eacute;g hef &thorn;v&iacute; og mun &thorn;v&iacute; tala fyrir daufum eyrum h&eacute;rna &aacute; &thorn;essu bloggi. &THORN;ess vegna er &eacute;g a&eth; velta &thorn;v&iacute; fyrir m&eacute;r a&eth; gera tvennt; annars vegar &uacute;tv&iacute;kka umfj&ouml;llunarefni bloggsins og hins vegar skrifa &aacute; ensku (til &thorn;ess a&eth; n&aacute; til st&aelig;rri h&oacute;ps &thorn;egar umfj&ouml;llunarefni&eth; er <span style="font-style: italic;">Haskell</span>). &Eacute;g er me&eth; nokkrar hugmyndir sem &eacute;g hef&eth;i &aacute;huga &aacute; a&eth; skrifa um eftir a&eth; &thorn;etta bloggkerfi er komi&eth; vel &aacute; koppinn &thorn;v&iacute; mig langar, seinna meir, til &thorn;ess a&eth; sko&eth;a betur hlj&oacute;&eth; og mynd og &yacute;mislegt sem &thorn;v&iacute; tengist &aacute;samt p&aelig;lingum &uacute;r fj&aacute;rm&aacute;lageiranum. Hitt er svo anna&eth; a&eth; &eacute;g er b&uacute;inn a&eth; gera &thorn;a&eth; a&eth; forgangsverkefni fyrir &thorn;etta blogg a&eth; b&uacute;a til <span style="font-style: italic;"><a href="http://diveintomark.org/archives/2004/05/28/howto-atom-id">Atom-</a></span><a href="http://diveintomark.org/archives/2004/05/28/howto-atom-id">straum</a>, brenna bloggi&eth; me&eth; <a href="http://feedburner.com/">Feedburner.com<span style="color: #333333;">&nbsp;og&nbsp;</span></a><a href="http://twitterfeed.com/">f&aelig;&eth;a</a> &thorn;v&iacute; yfir &iacute; Twitter. &THORN;a&eth; m&aacute; &thorn;v&iacute; b&uacute;ast vi&eth; &thorn;v&iacute; a&eth; n&aelig;sta f&aelig;rsla um bloggi&eth; ver&eth;i &aacute; ensku.</p>



