---
title: Tímamót
author: Gísli Kristjánsson
tags: icelandic
id: 1
timestamp: 22.10.2007 20:30:52
filename: 2007-10-22-timamot.html
---

<p><span style="line-height: normal;">&Iacute; nokkrar vikur hef &eacute;g velt &thorn;v&iacute; fyrir m&eacute;r a&eth; byrja a&eth; blogga. &Aacute;st&aelig;&eth;an fyrir &thorn;essum vangaveltum er s&uacute; a&eth; &eacute;g hef &aacute;huga &aacute; &thorn;v&iacute; a&eth; taka virkari &thorn;&aacute;tt &iacute; vefsamf&eacute;laginu. Ennfremur vil &eacute;g l&iacute;ta &aacute; bloggi&eth; sem faglega &uacute;tr&aacute;s &aacute; &thorn;eim svi&eth;um sem &eacute;g hef &aacute;huga &aacute;, &thorn;.e. t&aelig;kni (&thorn;&aacute; a&eth;allega t&ouml;lvut&aelig;kni), fj&aacute;rm&aacute;lum, ...<br /><br />&THORN;a&eth; er h&aacute;lfger&eth; hr&aelig;sni a&eth; tala um a&eth; hafa &aacute;huga &aacute; t&ouml;lvut&aelig;kni &thorn;egar &thorn;etta blogg er skrifa&eth; &aacute; eins frumst&aelig;&eth;an h&aacute;tt og m&ouml;gulegt er. Plani&eth; er a&eth; nota &thorn;ennan vettvang til &thorn;ess a&eth; l&aelig;ra n&yacute;tt forritunarm&aacute;l og byggja upp bloggkerfi og &uacute;tv&iacute;kka &thorn;a&eth; (wiki, o.s.frv.) svo fyrir vefsetur mitt en &thorn;anga&eth; til &thorn;&aacute;; textaskjal (<code>blog.txt</code>) og textaritill (Aquamacs). Forritunarm&aacute;lin sem koma til greina eru eru flest fallam&aacute;l,&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.python.org/">Python</a>&nbsp;(ekki fallam&aacute;l),&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://en.wikipedia.org/wiki/JavaScript">JavaScript</a>&nbsp;(&iacute; &aelig;tt vi&eth; fallam&aacute;l),&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.erlang.org/">Erlang</a>,&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://caml.inria.fr/">Objective Caml</a>,&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.lisp.org/">LISP</a>, og&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.haskell.org/">Haskell</a>. Mig langar til &thorn;ess a&eth; fara alveg n&yacute;ja lei&eth;, stokka alveg upp hugsanaganginum svo &eacute;g held a&eth; lendingin ver&eth;i a&eth; &eacute;g skrifi &thorn;etta &iacute;&nbsp;Haskell. &THORN;essi p&oacute;stur markar upphaf &thorn;essa&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://en.wikibooks.org/wiki/Haskell">fer&eth;alags</a>.

