---
title: Facebook
author: Gísli Kristjánsson
tags: icelandic, skydiving
id: 11
timestamp: 07.08.2008 01:06:57
filename: 2008-08-07-facebook.html
---

<p><span style="line-height: normal;">&THORN;egar &eacute;g var staddur &uacute;ti &aacute;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://maps.google.com/maps?f=q&amp;hl=en&amp;geocode=&amp;q=Ocana,+Spain&amp;ie=UTF8&amp;t=h&amp;z=11&amp;iwloc=addr">Sp&aacute;ni</a>&nbsp;&iacute;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://youtube.com/user/gislikristjans">fallhl&iacute;fast&ouml;kkinu</a>&nbsp;(sj&aacute; fyrri f&aelig;rslu) &thorn;&aacute; t&oacute;k &eacute;g eftir &thorn;v&iacute; a&eth; strax &aacute; fyrsta degi voru allir b&uacute;nir a&eth; "h&uacute;kka s&eacute;r saman" &aacute;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://facebook.com/">Facebook</a>&nbsp;(FB). &Eacute;g hef &iacute; nokkurn t&iacute;ma haft illan bifur &aacute; &ouml;llu svona. &Eacute;g held a&eth; &thorn;a&eth; hafi veri&eth;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://myspace.com/">MySpace</a>&nbsp;sem ey&eth;ilagi &thorn;etta fyrir m&eacute;r - &thorn;v&iacute;l&iacute;kt kaos!<br /><br />En &thorn;egar &eacute;g &aacute;tta&eth;i mig &aacute; &thorn;v&iacute; a&eth; mig langa&eth;i til &thorn;ess a&eth; halda sambandi vi&eth; &thorn;ennan h&oacute;p og til &thorn;ess a&eth; vera alveg sannleikanum sannkv&aelig;mur &thorn;&aacute; var &eacute;g ekki a&eth; fara hringja &iacute; &thorn;au (og sennilega ekki einu sinni a&eth; fara a&eth; senda &thorn;eim t&ouml;lvup&oacute;st). &Eacute;g &aacute;kva&eth; &thorn;v&iacute; a&eth; leggja&nbsp;FB-hrokann minn til hli&eth;ar og skr&aacute; mig inn.<br /></span></p>
<blockquote>
<p><span style="line-height: normal;">Og, ver&eth; a&eth; vi&eth;urkenna a&eth;&nbsp;FB&nbsp;er ekki svo gali&eth; eftir allt saman.</span></p>
<p><span style="line-height: normal;"><br /></span></p>
</blockquote>
<p><span style="line-height: normal;">Til &thorn;ess a&eth; gera langa s&ouml;gu stutta er &eacute;g gj&ouml;rsamlega fallinn. Og, ver&eth; a&eth; vi&eth;urkenna a&eth;&nbsp;FB&nbsp;er ekki svo gali&eth; eftir allt saman. Ma&eth;ur er n&uacute; farinn a&eth; gera allt &thorn;etta helsta; "adda vinum", skrifa &aacute; veggi og &aacute;&eth;ur en &eacute;g veit af ver&eth; &eacute;g farinn a&eth; senda s&yacute;ndarbj&oacute;ra! Reyndar held &eacute;g a&eth; &thorn;a&eth; s&eacute; langt (ef einhvern t&iacute;mann) &iacute; a&eth; &eacute;g fari a&eth; senda s&yacute;ndarbj&oacute;ra. &THORN;egar &eacute;g hugsa um &thorn;a&eth; &thorn;&aacute; er &thorn;a&eth; sennilega s&aacute; &thorn;&aacute;ttur sem pirrar mig mest.<br /><br />Reyndar s&eacute; &eacute;g n&uacute;na a&eth; &thorn;etta er fr&aacute;b&aelig;r lei&eth; til &thorn;ess a&eth; halda sambandi vi&eth; f&oacute;lk (og &thorn;&aacute; s&eacute;rstaklega f&oacute;lk sem ma&eth;ur hittir ekki &aacute; &ouml;llu j&ouml;fnu). &Eacute;g er t.d. b&uacute;inn a&eth; finna t&yacute;nda &aelig;skuf&eacute;laga, bekkjarf&eacute;laga og a&eth;ra sem &eacute;g var b&uacute;inn a&eth; missa af.&nbsp;<br /><br />&THORN;a&eth; sem m&eacute;r finnst hins vegar lang mest spennandi er&nbsp;FB-&thorn;r&oacute;unarumhverfi&eth; sj&aacute;lft. &Eacute;g hef nefnilega lengi gengi&eth; me&eth; hugmynd &iacute; maganum en hef einhvern veginn aldrei komi&eth; m&eacute;r &iacute; a&eth; framkv&aelig;ma hana vegna &thorn;ess a&eth; &thorn;a&eth; til &thorn;ess a&eth; geta framkv&aelig;mt hana &thorn;arf &eacute;g a&eth; gera heil &oacute;sk&ouml;p &aacute;&eth;ur. &THORN;a&eth; magna&eth;a er a&eth;&nbsp;FB&nbsp;eru &thorn;essi heilu &oacute;sk&ouml;p; og &eacute;g get einbeitt m&eacute;r a&eth; &thorn;v&iacute; a&eth; framkv&aelig;ma hugmyndina sj&aacute;lfa.<br /><br />&THORN;a&eth; sem er l&iacute;ka spennandi vi&eth; a&eth; &thorn;r&oacute;a &thorn;etta &aacute;&nbsp;FB&nbsp;er fj&ouml;ldi notenda. &THORN;a&eth; er h&aelig;gt a&eth; koma hugmyndum &iacute; dreifingu &aacute; mj&ouml;g sk&ouml;mmum t&iacute;ma til mj&ouml;g margra og ef m&eacute;r tekst vel til &aelig;tti a&eth; vera h&aelig;gt a&eth; hafa tekjur af &thorn;essu.<br /><br />Plani&eth; er &thorn;v&iacute; a&eth; sko&eth;a&nbsp;FB-&thorn;r&oacute;unarumhverfi&eth; betur. &Eacute;g er b&uacute;inn a&eth; vera a&eth; forrita &aacute;kve&eth;inn feril (upphaf vi&eth;skipta) &iacute; vinnunni upp &aacute; s&iacute;&eth;kasti&eth;. Til &thorn;ess hef &eacute;g veri&eth; a&eth; nota&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://python.org/">Python</a>&nbsp;og er gj&ouml;rsamlega &aacute;stfanginn af &thorn;v&iacute; forritunarm&aacute;li. &THORN;a&eth; virkar eins og hugur manns. Hins vegar hef &eacute;g veri&eth; a&eth; velta &thorn;v&iacute; fyrir m&eacute;r hvort &thorn;a&eth; s&eacute; heppilegt sem&nbsp;FB-forritunarm&aacute;l og er eiginlega kominn a&eth; &thorn;eirri ni&eth;urst&ouml;&eth;u a&eth; svo s&eacute; ekki vegna &aacute;lags &aacute;&nbsp;FB-hugb&uacute;na&eth;.&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://haskell.org/">Haskell</a>&nbsp;er ekki me&eth; allt of g&oacute;&eth;an stu&eth;ning vi&eth; vefforritun (og &thorn;a&eth; tekur lengri t&iacute;ma a&eth; koma s&eacute;r inn &iacute; &thorn;a&eth; en &eacute;g hef). &Eacute;g hef &thorn;v&iacute; veri&eth; a&eth; horfa til&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://erlang.org/">Erlang</a>&nbsp;sem vir&eth;ist vera kj&ouml;ri&eth; &iacute; &thorn;essum a&eth;st&aelig;&eth;um.<br /><br />&Eacute;g skrifa meira um &thorn;essar p&aelig;lingar &thorn;egar &thorn;&aelig;r eru komnar lengra &aacute; veg.</span></p>
<!--more-->



