---
title: Síðan þokast áfram
author: Gísli Kristjánsson
tags: icelandic
id: 6
timestamp: 28.01.2008 05:30:24
filename: 2008-01-28-sidan-thokast-afram.html
---

<p><span style="line-height: normal;">&Iacute; dag eyddi &eacute;g talsver&eth;um t&iacute;ma &iacute; s&iacute;&eth;una. H&eacute;r er h&aelig;gt a&eth; nefna a&eth;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.google.com/notebook/public/01738234982158720746/BDShxQwoQoIbXy_oi">verkefnas&iacute;&eth;an</a>&nbsp;er komin vel af sta&eth;. 
<!--more-->
Eing&ouml;ngu er &thorn;&oacute; um texta a&eth; r&aelig;&eth;a en &thorn;egar &eacute;g ver&eth; kominn me&eth; sm&aacute; textastubb um &ouml;ll verkin &aelig;tla &eacute;g a&eth; b&aelig;ta vi&eth; textann og hengja myndir me&eth; verkefnunum.&nbsp;<br /><br /><a style="color: #cc6600; text-decoration: none;" href="http://google.com/notebook/public/01738234982158720746/BDSdwQwoQzPC91Psi">Uppl&yacute;singas&iacute;&eth;an</a>&nbsp;var l&iacute;ka tekin &iacute; gegn og n&yacute;tt efni sett inn. &Eacute;g er or&eth;inn nokku&eth; &aacute;n&aelig;g&eth;ur me&eth; efni&eth;. Fyrir nyr&eth;ina &thorn;arna &uacute;ti bj&oacute; &eacute;g l&iacute;ka til n&yacute;ja s&iacute;&eth;u sem l&yacute;sir&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.google.com/notebook/public/01738234982158720746/BDSe5QgoQ0NzJ8vsi">&aacute;standi</a>&nbsp;vefsins &iacute; &thorn;a&eth; og &thorn;a&eth; skipti&eth;.<br /><br />Svo fyrir &thorn;&aacute; sem h&ouml;f&eth;u s&eacute;&eth; bloggi&eth; taka &thorn;eir v&aelig;ntanlega eftir a&eth; h&eacute;r hefur einnig &yacute;mislegt veri&eth; gert en mestu breytingarnar eru a&eth; bloggi&eth; er komi&eth; inn &iacute; a&eth;al&uacute;tliti&eth; &iacute; sta&eth; &thorn;ess a&eth; vera bara textaskjal.<br /><br />Heilt yfir er &thorn;essi &aelig;fing me&eth; a&eth; tengja&nbsp;Google Notebook&nbsp;og textaskj&ouml;l inn &aacute; vefs&iacute;&eth;una me&eth; JavaScript. St&oacute;r galli er &thorn;&oacute; a&eth;&nbsp;Back-hnappurinn virkar ekki. &THORN;etta lagast &thorn;&oacute; &aacute;llt sj&aacute;lfkrafa &thorn;egar Haskell&nbsp;fer a&eth; &thorn;j&oacute;na &thorn;essu efni.</span></p>



