---
title: Skúli.is
author: Gísli Kristjánsson
tags: icelandic
id: 7
timestamp: 05.02.2008 19:24:14
filename: 2008-02-05-skuli-is.html
---

<p><span style="line-height: normal;"><a style="color: #cc6600; text-decoration: none;" href="http://skuli.is/">Vefur</a>&nbsp;vinah&oacute;psins hefur legi&eth; &iacute; dvala &iacute; um 2 &aacute;r eftir a&eth; gamli vefurinn var lag&eth;ur ni&eth;ur. Vi&eth; skrifu&eth;um annan fyrir &aacute;rsh&aacute;t&iacute;&eth; Sk&uacute;la &iacute; fyrir &iacute;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://rubyonrails.org/">Ruby on Rails</a>&nbsp;en &thorn;ar sem vi&eth; h&ouml;f&eth;um enga v&eacute;l til a&eth; keyra hann f&oacute;r hann aldrei &iacute; lofti&eth;. 
<!--more-->
N&uacute;na &thorn;egar n&yacute;i &thorn;j&oacute;nninn er kominn &iacute; gagni&eth; kemur &iacute; lj&oacute;s a&eth; Rails&nbsp;hefur breyst &thorn;a&eth; miki&eth; s&iacute;&eth;an &iacute; fyrra a&eth; k&oacute;&eth;inn okkar keyrir ekki. Talsvert svekkelsi!<br /><br />&Eacute;g veit ekki hva&eth; &eacute;g er b&uacute;inn a&eth; skrifa m&ouml;rg vefkerfi og tilhugsunin um a&eth; skrifa enn eitt er m&eacute;r alls ekki k&aelig;r. M&eacute;r datt &thorn;v&iacute; &iacute; hug a&eth; keyra vefinn &aacute; einhverju&nbsp;CMS-kerfanna. &THORN;a&eth; kemur hins vegar alltaf a&eth; &thorn;v&iacute; a&eth; ma&eth;ur hefur &aacute;huga &aacute; &thorn;v&iacute; a&eth; fara &ouml;rl&iacute;ti&eth; &uacute;t fyrir mynstur kerfisins og &thorn;&aacute; ver&eth;ur l&iacute;f manns skelfilegt - fl&oacute;ki&eth; og lei&eth;inlegt. &Eacute;g einsetti m&eacute;r &thorn;v&iacute; a&eth; skrifa eins l&iacute;ti&eth; vefkerfi og &eacute;g m&ouml;gulega kemst upp me&eth;.<br /><br /><a style="color: #cc6600; text-decoration: none;" href="http://webpy.org">web.py</a>&nbsp;er minimal&iacute;skt umhverfi fyrir&nbsp;Python&nbsp;og fellur &thorn;v&iacute; eins og fl&iacute;s vi&eth; rass a&eth; forsendunum. &Eacute;g er l&iacute;ka kominn me&eth; lei&eth;a &aacute; &thorn;v&iacute; a&eth; m&oacute;dela g&ouml;gn &iacute; gagnagrunni og &thorn;v&iacute; datt &eacute;g inn &aacute; n&yacute;ja tegund af gagnagrunni, svokalla&eth;an skjalagagnagrunn&nbsp;<em>(e. document-centric database)</em>&nbsp;sem heitir&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://couchdb.com/">CouchDB</a>. Haft er samband vi&eth; grunninn yfir&nbsp;HTTP-sta&eth;alinn og skilar grunnurinn g&ouml;gnum &aacute;&nbsp;JSON-formi. Frekar spennandi!</span></p>



