---
title: "HAppS: Góðar og slæmar fréttir"
author: Gísli Kristjánsson
tags: icelandic, happstack
id: 5
timestamp: 22.01.2008 06:03:38
filename: 2008-01-22-happs-godar-og-slaemar-frettir.html
---

<p><span style="line-height: normal; ">Eftir a&eth; hafa skrifa&eth; s&iacute;&eth;asta p&oacute;st hl&oacute;&eth; &eacute;g ni&eth;ur&nbsp;Colloquy, sem er&nbsp;IRC-bi&eth;lari fyrir&nbsp;Mac OS X. &THORN;ar skr&aacute;&eth;i &eacute;g mig &aacute; r&aacute;sina&nbsp;<b>#happs</b>&nbsp;og byrja&eth;i a&eth; spjalla. <!--more-->
Til a&eth; byrja me&eth; svara&eth;i m&eacute;r enginn en &thorn;a&eth; var e.t.v. e&eth;lilegt &iacute; lj&oacute;si &thorn;ess a&eth; &thorn;a&eth; var mi&eth; n&oacute;tt. Daginn eftir lifna&eth;i &thorn;&oacute; a&eth;eins vi&eth; m&ouml;nnum &aacute; r&aacute;sinni. Menn voru almennt samm&aacute;la &thorn;v&iacute; a&eth; ekki v&aelig;ri heppilegt a&eth; byrja&nbsp;Haskell-upplifunina &aacute; &thorn;v&iacute; a&eth; st&uacute;dera&nbsp;HAppS. &THORN;etta voru a&eth; sj&aacute;lfs&ouml;g&eth;u gr&iacute;&eth;arleg vonbrig&eth;i fyrir mig enda haf&eth;i &eacute;g gert m&eacute;r vonir um a&eth; l&aelig;ra m&aacute;li&eth; og jafnframt koma undir mig f&oacute;tunum &aacute; vefheimili m&iacute;nu (gisli.hamstur.is). Hins vegar get &eacute;g vel skili&eth; &thorn;eirra r&ouml;k og hef &thorn;v&iacute; hugsa&eth; m&eacute;r a&eth; gera eftirfarandi:<br /> 
<ul style="color: #333333; ">
<br />
<li><strong>Setja upp&nbsp;HAppS-&thorn;j&oacute;n sem &thorn;j&oacute;nar stat&iacute;sku efni</strong><br />&THORN;ess vegna er &thorn;etta blogg n&uacute;na eing&ouml;ngu texti.</li>
<br />
<li><strong>Finna m&eacute;r &uacute;tlit</strong><br />Koma s&iacute;&eth;unni &iacute; fallegri b&uacute;ning, &thorn;r&aacute;tt fyrir a&eth; allt ver&eth;i stat&iacute;skt.</li>
<br />
<li><strong>L&aelig;ra grunninn &iacute;&nbsp;Haskell</strong><br />&Aacute;&eth;ur en &eacute;g fer a&eth; fikta miki&eth; &iacute;&nbsp;HAppS.</li>
</ul>
<br />Sm&aacute;m saman b&aelig;tist &iacute; &thorn;ekkinguna &thorn;annig a&eth; &eacute;g geti fegra&eth; og forrita&eth; kerfi &aacute; bak vi&eth; bloggi&eth;. &THORN;etta ver&eth;ur &thorn;v&iacute; a&eth;eins lengra ferli en &eacute;g var a&eth; vonast til.<br /><br />G&oacute;&eth;u fr&eacute;ttirnar eru hins vegar &thorn;&aelig;r a&eth; &eacute;g n&aacute;&eth;i a&eth; koma&nbsp;HAppS-&thorn;j&oacute;ni upp og t&oacute;kst a&eth; l&aacute;ta bei&eth;nir &aacute; r&oacute;tina &aacute;framsendast &aacute; bloggi&eth; mitt, &thorn;.e. &thorn;etta textaskjal. &THORN;etta gekk ekki vandr&aelig;&eth;alaust fyrir sig og ef til vill er &thorn;etta &oacute;&thorn;arflega fl&oacute;ki&eth; hj&aacute; m&eacute;r. </a>.</span></p>



