---
title: Gísli kemur að HAppS-vörðu
author: Gísli Kristjánsson
tags: icelandic, happstack
id: 13
timestamp: 06.12.2008 23:21:03
filename: 2008-12-06-gisli-kemur-að-happs-vörðu.html
---

<p>&Iacute; fyrirs&ouml;gninni er &eacute;g a&eth; v&iacute;sa &iacute; v&ouml;r&eth;u &iacute; merkingunni <span style="font-style: italic;">Milestone. </span>Loksins kom a&eth; &thorn;v&iacute; a&eth; &thorn;essi vefur er or&eth;inn HAppS/Haskell-v&aelig;ddur. &Aacute;&eth;ur var &thorn;essi vefur stat&iacute;skur en d&yacute;nam&iacute;kin bygg&eth;i &aacute; &ouml;&eth;rum &thorn;j&oacute;nustum, s.s. Google Notebook. JavaScript&nbsp;var nota&eth; til &thorn;ess a&eth; br&uacute;a bili&eth; &aacute; milli &thorn;j&oacute;nustanna og vefs&iacute;&eth;unnar. &Aacute;st&aelig;&eth;urnar fyrir &thorn;essu fyrirkomulagi voru 2.</p>
<!--more-->
<ol>
<li>&Eacute;g haf&eth;i ekki &aacute;huga &aacute; &thorn;v&iacute; a&eth; b&uacute;a til heilt vefkerfi. &THORN;a&eth; hef &eacute;g gert einum of oft og n&uacute; &aacute; t&iacute;mum er h&aelig;gt a&eth; n&yacute;ta s&eacute;r parta fr&aacute; &ouml;&eth;rum og p&uacute;sla &thorn;eim saman &iacute; sitt eigi&eth; kerfi.</li>
<li>&Eacute;g haf&eth;i ekki n&aelig;ga &thorn;ekkingu &aacute; Haskell&nbsp;til &thorn;ess a&eth; geta b&uacute;i&eth; til vefkerfi.&nbsp;</li>
</ol>
<p>&THORN;egar &eacute;g f&oacute;r a&eth; sko&eth;a&nbsp;HAppS&nbsp;var m&eacute;r&nbsp;<a style="color: #cc6600; text-decoration: none;" href="../show/5">tj&aacute;&eth;</a>&nbsp;a&eth; ekki v&aelig;ri heppilegt a&eth; byrja &aacute; &thorn;eim endanum. Eftir &aacute; a&eth; hyggja er &eacute;g hjartanlega samm&aacute;la &thorn;v&iacute; a&eth; byrja einhvers sta&eth;ar annars sta&eth;ar. &THORN;v&iacute; &thorn;r&aacute;tt fyrir a&eth; hafa fengi&eth; &thorn;essa v&iacute;sbendingu t&oacute;k &thorn;a&eth; mig um 3 tilraunir til &thorn;ess a&eth; komast inn &iacute; Haskell-hugsunarh&aacute;ttinn.&nbsp;</p>
<p style="text-align: center;"><img src="http://farm4.static.flickr.com/3181/3095639499_75de3a88d1.jpg" alt="Stj&oacute;rnbor&eth; bloggsins m&iacute;ns" width="500" height="418" /></p>
<p><Bloggi&eth; var s&aacute; hluti sem &eacute;g &aacute;kva&eth; a&eth; byrja &aacute; og til &thorn;ess a&eth; koma &thorn;v&iacute; &iacute; kring &thorn;urfti &eacute;g a&eth; sm&iacute;&eth;a notenda- og setukerfi <span style="font-style: italic;">(user and session management system)</span>. Me&eth;&nbsp;<a href="http://en.wikipedia.org/wiki/Openid">OpenID</a>&nbsp;er h&aelig;gt a&eth; l&aacute;ta a&eth;ra vefi, eins og Google, Yahoo! og Facebook,&nbsp;halda utan um notandanafni&eth; og lykilor&eth;i&eth;. &Iacute; seinni p&oacute;stum &aelig;tla &eacute;g a&eth; fjalla betur um hvernig <span style="font-style: italic;">OpenID</span>&nbsp;virkar.&nbsp;Einnig &aelig;tla &eacute;g &iacute; seinni p&oacute;stum a&eth; r&aelig;&eth;a &thorn;a&eth; sem &eacute;g hef l&aelig;rt og v&iacute;sa &iacute; k&oacute;&eth;ann minn sem d&aelig;mi. &Iacute; &thorn;essum p&oacute;sti langar mig &thorn;&oacute; til &thorn;ess a&eth; r&aelig;&eth;a uppsetninguna &iacute; gr&oacute;fum dr&aacute;ttum:</p>
<p style="text-align: center;"><img src="http://farm4.static.flickr.com/3143/3095639497_6a2ba0b718.jpg" alt="Innskr&aacute;ningargluggi bloggsins m&iacute;ns" width="500" height="418" /></p>
<p>&THORN;egar bei&eth;ni um vefs&iacute;&eth;u kemur inn tekur HAppS&nbsp;&aacute; m&oacute;ti bei&eth;ninni &nbsp;og &aacute;framsendir hana &aacute; r&eacute;tta st&yacute;ru<span style="font-style: italic;">&nbsp;(controller). </span>St&yacute;ran hefur s&iacute;&eth;an samband vi&eth; st&ouml;&eth;uv&eacute;lina, <a href="http://hackage.haskell.org/cgi-bin/hackage-scripts/package/HAppS-State">HAppS-State</a>, og gerir anna&eth; hvort fyrirspurnir &aacute; henni e&eth;a breytingar. A&eth; lokum eru g&ouml;gnin <span style="font-style: italic;">(model)</span> &uacute;r st&ouml;&eth;uv&eacute;linni send fram &iacute; birtingarlagi&eth; <span style="font-style: italic;">(view) </span>en &thorn;ar tekur <a href="http://hackage.haskell.org/cgi-bin/hackage-scripts/package/HStringTemplate">HStringTemplate</a>&nbsp;&nbsp;vi&eth; &thorn;eim og breytir &iacute; <span style="font-style: italic;">HTML.</span></p>
<p>N&aelig;stu skref eru a&eth; b&aelig;ta vi&eth; stu&eth;ningi fyrir t&ouml;g, athugasemdir og TrackBack &aacute;samt &thorn;v&iacute; a&eth; tengja eitthvert myndakerfi vi&eth; bloggi&eth;<span style="font-style: italic;">&nbsp;</span>en &eacute;g &aelig;tla a&eth;eins a&eth; b&iacute;&eth;a me&eth; &thorn;a&eth; &thorn;ar sem &eacute;g &aelig;tla a&eth; einbeita m&eacute;r a&eth; &ouml;&eth;ru <a href="http://baldurkristjans.is">verkefni</a> fyrir Baldur br&oacute;&eth;ur.</p>



