---
title: HAppS
author: Gísli Kristjánsson
tags: icelandic, happstack
id: 4
timestamp: 17.01.2008 06:31:24
filename: 2008-01-17-happs.html
---

<p><span style="line-height: normal;">&THORN;a&eth; hefur runni&eth; upp fyrir m&eacute;r s&iacute;&eth;ustu daga a&eth; l&aelig;rd&oacute;msk&uacute;rvan fyrir vefforritun &iacute; Haskell er mj&ouml;g br&ouml;tt. &THORN;a&eth; er l&iacute;ti&eth; til af skrifu&eth;u efni. 
<!--more-->
M&eacute;r s&yacute;nist &thorn;&oacute; eftir &thorn;essa ranns&oacute;knarvinnu a&eth; &thorn;rj&aacute;r lei&eth;ir s&eacute;u helst f&aelig;rar:<br /><ol style="color: #333333;"><br />
<li><strong>Keyra k&oacute;&eth;ann sem CGI &iacute; vef&thorn;j&oacute;ni</strong><br />Kostur: Ekki &thorn;arf a&eth; &thorn;&yacute;&eth;a&nbsp;Haskell&nbsp;k&oacute;&eth;ann.<br />Galli: H&aelig;gvirkt</li>
<br />
<li><strong>Keyra k&oacute;&eth;ann sem&nbsp;<a style="color: #cc6600; text-decoration: none;" href="https://fastcgi-archives.github.io/">FastCGI</a>&nbsp;&iacute; vef&thorn;j&oacute;ni</strong><br />Kostur: Getur keyrt &aacute; &thorn;ekktum vef&thorn;j&oacute;num eins og&nbsp;Apache&nbsp;og&nbsp;LigHTTP.<br />Galli: &THORN;arf a&eth; endurr&aelig;sa vef&thorn;j&oacute;ninn til &thorn;ess a&eth; breytingar taki gildi.</li>
<br />
<li><strong>Keyra k&oacute;&eth;ann &iacute;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://happs.org/">HAppS</a>,&nbsp;<em>The Haskell Application Server</em></strong><br />Kostur: Margir, sj&aacute; umfj&ouml;llun h&eacute;r a&eth; ne&eth;an<br />Galli: N&aacute;nst engar uppl&yacute;singar um&nbsp;HAppS</li>
<br /></ol><br />&THORN;ar sem &eacute;g er &aacute; h&ouml;ttunum eftir algj&ouml;rlega n&yacute;rri hugsun (eins og fram kemur &iacute; fyrstu f&aelig;rslunni) &aacute;kva&eth; &eacute;g a&eth; velja s&iacute;&eth;ustu lei&eth;ina, &thorn;.e. nota&nbsp;HAppS. &Eacute;g eyddi um klukkut&iacute;ma &iacute; a&eth; horfa &aacute;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.bayfp.org/blog/2007/10/16/alex-jacobson-on-happs-videos-slides/">fyrirlestur</a> um&nbsp;HAppS&nbsp;sem Alex Jacobson, h&ouml;fundur&nbsp;HAppS, h&eacute;lt &iacute; okt&oacute;ber &aacute; s&iacute;&eth;asta &aacute;ri. &THORN;ar sem &eacute;g hef lengi veri&eth; &iacute; vefforritun og sj&aacute;lfur me&eth; hugmyndir um &thorn;a&eth; hvernig m&eacute;r finnist hluturnir eiga vera ger&eth;ir kom m&eacute;r skemmtilega &aacute; &oacute;vart hva&eth; Alex haf&eth;i skemmtilega og &iacute; raun mj&ouml;g samb&aelig;rilega s&yacute;n.<br /><br />&Iacute; venjulegu vefumhverfi, oft nefnt N-laga umhverfi, skiptist umhverfi&eth; venjulega &iacute; &thorn;rj&uacute; l&ouml;g:<br /><ol style="color: #333333;"><br />
<li><strong>Gagnam&oacute;delslag</strong><br />G&ouml;gn eru &iacute; flestum tilfellum geymd &iacute; gagnagrunnum en til &thorn;ess a&eth; g&ouml;gnin s&eacute;u noth&aelig;f &thorn;arf a&eth; m&oacute;dela g&ouml;gnin &iacute; forritunarm&aacute;linu sem nota&eth; er.</li>
<br />
<li><strong>A&eth;ger&eth;alag</strong><br />H&eacute;r er virkni vefjarins &aacute;kve&eth;in.</li>
<br />
<li><strong>Framsetningarlag</strong><br />&THORN;egar a&eth;ger&eth;arlagi&eth; er b&uacute;i&eth; a&eth; vinna me&eth; gagnam&oacute;delin eru &thorn;au &aacute;framsend &iacute; &thorn;etta lag. Venjulega er &thorn;a&eth; h&eacute;r sem blanda af forritunarm&aacute;li og HTMLi skilar ni&eth;urst&ouml;&eth;unum til vafrans.</li>
<br /></ol><br />Gallinn vi&eth; &thorn;essa uppsetningu er oft &aacute; t&iacute;&eth;um s&aacute; a&eth; mikil vinna er f&oacute;lgin &iacute; &thorn;v&iacute; a&eth; koma g&ouml;gnunum &uacute;r gagnagrunninum og &iacute; str&uacute;kt&uacute;r sem n&yacute;tist &iacute; forritunarm&aacute;linu. Einnig getur veri&eth; erfitt a&eth; skala &thorn;etta umhverfi. &Eacute;g er &thorn;v&iacute; opinn fyrir &thorn;eim a&eth;fer&eth;um sem HAppS leggur til:<br /><br />G&ouml;gnin eru m&oacute;deleru&eth; fr&aacute; upphafi &iacute; Haskell og liti&eth; er &aacute; vefinn sem st&ouml;&eth;uv&eacute;l. Sta&eth;an hverju sinni er geymd &iacute; minni en skrifu&eth; &uacute;t &iacute; svokalla&eth;a logga. &THORN;annig getur &thorn;j&oacute;nninn sp&oacute;la&eth; &iacute; gegnum alla loggana til &thorn;ess a&eth; flytja kerfi&eth; &iacute; s&iacute;&eth;ustu st&ouml;&eth;u ef endurr&aelig;sa &thorn;arf &thorn;j&oacute;ninn. &THORN;etta hefur veri&eth; &thorn;ekkt sem&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.prevayler.org">Prevayler</a>-mynstri&eth;. Til &thorn;ess a&eth; koma &iacute; veg fyrir a&eth; &thorn;j&oacute;nninn &thorn;urfi a&eth; lesa loggana fr&aacute; &ouml;r&oacute;fi alda skrifar hann &uacute;t millist&ouml;&eth;ur&nbsp;<em>(e. Check point)</em>&nbsp;me&eth; reglulegu millibili. Eing&ouml;ngu &thorn;arf &thorn;&aacute; a&eth; lesa loggana fr&aacute; &thorn;eirri st&ouml;&eth;u. &Iacute; fyrirlestrinum kemur Alex l&iacute;ka inn &aacute; n&yacute;jan f&iacute;dus sem hle&eth;ur vi&eth;eigandi hluta st&ouml;&eth;uv&eacute;larinnar &iacute; minni ef h&uacute;n kemst ekki &ouml;ll fyrir &iacute; minninu - &thorn;etta &thorn;arf a&eth; gera handvirkt &iacute; dag.<br /><br />Prevayler-mynstri&eth; gerir HAppS kleyft a&eth; gera &yacute;msa sni&eth;uga hluti, eins og keyra klasa af HAppS-&thorn;j&oacute;num og samr&aelig;ma st&ouml;&eth;u &aacute; milli &thorn;eirra. &THORN;annig er h&aelig;gt a&eth; dreifa vinnslu &aacute; marga &thorn;j&oacute;na til &thorn;ess a&eth; minnka &aacute;lag &aacute; v&eacute;lb&uacute;na&eth; og koma &iacute; veg fyrir a&eth; vefir fari ni&eth;ur ef v&eacute;lb&uacute;na&eth;ur deyr. &THORN;etta &thorn;&yacute;&eth;ir l&iacute;ka a&eth; &thorn;egar uppf&aelig;ra &thorn;arf hugb&uacute;na&eth;inn ver&eth;a notendur ekki varir vi&eth; neinn ni&eth;rit&iacute;ma. Anna&eth; sem m&eacute;r fannst &aacute;hugavert vi&eth; uppf&aelig;rslur hugb&uacute;na&eth;arins og a&eth; koma &thorn;eim &iacute; rekstur er a&eth; &thorn;egar hugb&uacute;na&eth;urinn er &thorn;&yacute;ddur ver&eth;ur til ein keyrsluskr&aacute; sem eing&ouml;ngu &thorn;arf a&eth; afrita yfir &aacute; &thorn;&aacute; &thorn;j&oacute;na sem eiga a&eth; taka &thorn;&aacute;tt &iacute; verkinu. &THORN;j&oacute;narnir sj&aacute; alveg um a&eth; hla&eth;a inn n&yacute;ju &uacute;tg&aacute;funni.<br /><br />Tegundakerfi&eth;&nbsp;<em>(e. Type system)</em>&nbsp;&iacute; Haskell er gr&iacute;&eth;arlega &ouml;flugt og mj&ouml;g au&eth;velt og er &thorn;a&eth; t.d. einsm&oacute;ta XML. HAppS s&eacute;r &thorn;v&iacute; um a&eth; flytja g&ouml;gnin yfir &iacute; XML sj&aacute;lfvirkt og &thorn;v&iacute; &thorn;arf eing&ouml;ngu a&eth; umbreyta XML-inu, me&eth; hj&aacute;lp&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.w3.org/Style/XSL/">XSL</a>, yfir &iacute; anna&eth; birtingaform.<br /><br />M&eacute;r finnst HAppS spennandi og ekki s&iacute;&eth;ur &iacute; &thorn;v&iacute; lj&oacute;si a&eth; HAppS vir&eth;ist vera Haskell-lei&eth;in &iacute; vefforritun. Hins vegar er &eacute;g hr&aelig;ddur um a&eth; &thorn;etta geti or&eth;i&eth; erfi&eth; f&aelig;&eth;ing vegna l&iacute;tillar skj&ouml;lunar. M&eacute;r skilst a&eth; HAppS-li&eth;i&eth; hangi &aacute; IRC-inu svo &eacute;g &aelig;tla a&eth; reyna a&eth; f&aacute; v&iacute;sbendingar um hvernig er best a&eth; l&aelig;ra &aacute; gr&aelig;juna.</span></p>



