---
title: Bloggið, Real World Haskell og HAppS
author: Gísli Kristjánsson
tags: icelandic
id: 12
timestamp: 21.11.2008 01:20:35
filename: 2008-11-21-bloggid-real-world-haskell-og-happs.html
---

<p><span style="line-height: normal;">Af einhverri &aacute;st&aelig;&eth;u er &eacute;g andvaka n&uacute;na en &thorn;a&eth; er mj&ouml;g skr&iacute;ti&eth; &iacute; lj&oacute;si &thorn;ess a&eth; &eacute;g var &iacute; nuddi fyrr &iacute; dag og nuddarinn t&oacute;k svo vel &aacute; m&eacute;r a&eth; &eacute;g var vi&eth; &thorn;a&eth; a&eth; sofna um kv&ouml;ldmatarleyti&eth;. N&uacute;na hins vegar er &eacute;g gla&eth;vakandi.
   <!--more-->
   <br /><br />M&eacute;r fannst &thorn;v&iacute; a&eth; &eacute;g g&aelig;ti nota&eth; t&iacute;mann og hent einni stuttri f&aelig;rslu h&eacute;r inn (skammast m&iacute;n fyrir a&eth; &thorn;a&eth; s&eacute;u r&uacute;mir 3 m&aacute;nu&eth;ir li&eth;nir fr&aacute; s&iacute;&eth;ustu f&aelig;rslu). S&iacute;&eth;ustu vikur hefur &thorn;&oacute; talsvert veri&eth; a&eth; st&uacute;dera Haskell&nbsp;me&eth; &thorn;a&eth; a&eth; lei&eth;arlj&oacute;si a&eth; skrifa meira af &thorn;essari s&iacute;&eth;u &iacute; &thorn;v&iacute;. N&uacute;na &iacute; desember kemur &uacute;t b&oacute;kin&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://book.realworldhaskell.org/">Real World Haskell</a>, &uacute;tgefin af&nbsp;<em>O'Reilly</em>, sem h&aelig;gt er a&eth; lesa &oacute;keypis &iacute; heilu lagi &aacute;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://book.realworldhaskell.org/">netinu</a>. &Eacute;g er b&uacute;inn a&eth; lesa megni&eth; af henni og ver&eth; &eacute;g a&eth; hr&oacute;sa b&aelig;&eth;i &thorn;essu framtaki og l&iacute;ka g&aelig;&eth;i b&oacute;karinnar. Loksins er &eacute;g farinn a&eth; setja hlutina &iacute; samhengi og strax eftir a&eth; &eacute;g var b&uacute;inn a&eth; lesa hana t&oacute;kst m&eacute;r a&eth; b&uacute;a til gr&aelig;ju sem tekur&nbsp;CSV-skjal me&eth; n&ouml;fnum og heimilisf&ouml;ngum, flettir &thorn;eim upp &aacute;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://ja.is/simaskra">ja.is&nbsp;</a>og skilar s&iacute;man&uacute;merinu til baka inn &iacute; n&yacute;ja&nbsp;CSV-skr&aacute;. Fram a&eth; &thorn;eim t&iacute;mapunkti gat &eacute;g eing&ouml;ngu skrifa&eth; forrit sem voru svona u.&thorn;.b. 2-5 l&iacute;nur.<br /><br />Eftir a&eth; vera kominn me&eth; &ouml;rl&iacute;ti&eth; meira sj&aacute;lfstraust &aacute;kva&eth; &eacute;g a&eth; l&iacute;ta &aacute;&nbsp;HAppS&nbsp;&aacute; n&yacute;. Vi&eth; g&uacute;glun (er h&aelig;gt a&eth; nota &thorn;etta or&eth; svona?) fann &eacute;g s&iacute;&eth;una&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://happstack.com/docs/crashcourse/index.html">happstutorial.com</a>&nbsp;sem er eins og l&eacute;ni&eth; gefur til kynna lei&eth;beiningas&iacute;&eth;a sem fer skref fyrir skref me&eth; manni &iacute; gegnum&nbsp;HAppS. &Aacute; s&iacute;&eth;unni &aacute; &thorn;&oacute; eftir a&eth; kl&aacute;ra &thorn;ann hluta sem sn&yacute;r a&eth;&nbsp;HAppS.State&nbsp;en &thorn;a&eth; er s&aacute; hluti sem geymir g&ouml;gnin. M&eacute;r til mikillar &aacute;n&aelig;gju t&oacute;k &eacute;g eftir &thorn;v&iacute; &thorn;egar &eacute;g setti lei&eth;beiningarnar upp &aacute; t&ouml;lvunni minni voru &thorn;essir hlutar kl&aacute;rir og &eacute;g gat fr&aelig;&eth;st betur en nokkurn t&iacute;man &aacute;&eth;ur um &thorn;a&eth; hvernig ma&eth;ur geymir g&ouml;gn. Ennfremur &uacute;tsk&yacute;ra &thorn;essar lei&eth;beiningar hvernig ma&eth;ur getur nota&eth;&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://hackage.haskell.org/cgi-bin/hackage-scripts/package/HStringTemplate">HStringTemplate</a> sem byggir &aacute; h&ouml;nnun&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://www.stringtemplate.org/">StringTemplate</a>&nbsp;fyrir&nbsp;<em>Java</em>,&nbsp;<em>C#</em>&nbsp;og&nbsp;<em>Python</em>.&nbsp;<a style="color: #cc6600; text-decoration: none;" href="http://softwaresimply.blogspot.com/">&THORN;essi</a>&nbsp;s&iacute;&eth;a hefur l&iacute;ka a&eth; geyma hagn&yacute;tar uppl&yacute;singar um forritun &iacute;&nbsp;HAppS.<br /><br />&Eacute;g er &thorn;v&iacute; kominn vel af sta&eth; me&eth; &thorn;a&eth; a&eth; flytja bloggi&eth; mitt &uacute;r venjulegri&nbsp;textaskr&aacute;&nbsp;yfir &iacute; d&yacute;nam&iacute;ska &uacute;tg&aacute;fu, skrifa&eth;a fyrir&nbsp;HAppS. &Aacute; n&aelig;stu vikum mun &eacute;g skrifa um &thorn;a&eth; sem &eacute;g l&aelig;ri og ver&eth;ur n&aelig;sti p&oacute;stur &thorn;v&iacute; um setustj&oacute;rnun&nbsp;<em>(session management)</em>&nbsp;og hvernig h&aelig;gt er a&eth; &uacute;tf&aelig;ra sl&iacute;kt &iacute;&nbsp;Haskell.</span></p>
